# Задача 23:
# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]
massive = [2,4,5,7,8,5,9]

def multi (mass):
    new_massive = []
    for (i,j) in zip(mass [0: int(len(mass)/2+1): 1], 
                     mass [-1: int(len(mass)/2-1): -1]):
        new_massive.append(i*j)
    return new_massive

print(f"произведения пар чисел списка равна -{multi(massive)} \nпарой считаем первый и последний элемент, второй и предпоследний и.т.д. ")